Revit 2027 API
EmbodiedCarbonCoefficientUnitType Enumeration
 Represents the unit type of Embodied Carbon coefficient in a EmbodiedCarbon asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EmbodiedCarbonCoefficientUnitType
Public Enumeration EmbodiedCarbonCoefficientUnitType
public enum class EmbodiedCarbonCoefficientUnitType
type EmbodiedCarbonCoefficientUnitType
Members
Member name | Value | Description
PerArea | 2 |  Embodied Carbon Coefficient per area
PerEnergy | 4 |  Embodied Carbon Coefficient per energy
PerItem | 6 |  Embodied Carbon Coefficient per item
PerLength | 1 |  Embodied Carbon Coefficient per length
PerMass | 5 |  Embodied Carbon Coefficient per Mass
PerVolume | 3 |  Embodied Carbon Coefficient per volume
Undefined | 0 |  Embodied Carbon Coefficient unit is Undefined
See Also
Reference
Autodesk.Revit.DB Namespace